# Diandra O'Connor Module 4 Project  2/4/23

### Domain: gymnastics

## Create a gymnastics DataFrame from a dictionary

In [1]:
import pandas as pd

scores_dict = {'Amanda': [9.85, 9.9, 9.775, 9.875], 'Natalie': [9.825, 9.85, 9.85, 9.9], 'Jamie': [9.9, 9.8, 9.75, 9.9], 'Katie': [9.85, 9.9, 9.875, 9.85]}

scores = pd.DataFrame(scores_dict)

scores

   Amanda  Natalie  Jamie  Katie
0   9.850    9.825   9.90  9.850
1   9.900    9.850   9.80  9.900
2   9.775    9.850   9.75  9.875
3   9.875    9.900   9.90  9.850

## Create a custom index

In [2]:
scores.index = ['Vault', 'Bars', 'Beam', 'Floor']

scores

       Amanda  Natalie  Jamie  Katie
Vault   9.850    9.825   9.90  9.850
Bars    9.900    9.850   9.80  9.900
Beam    9.775    9.850   9.75  9.875
Floor   9.875    9.900   9.90  9.850

In [3]:
scores['Katie']

Vault    9.850
Bars     9.900
Beam     9.875
Floor    9.850
Name: Katie, dtype: float64

In [4]:
scores.Natalie

Vault    9.825
Bars     9.850
Beam     9.850
Floor    9.900
Name: Natalie, dtype: float64

## Accessing Rows (loc, iloc)

In [5]:
scores.loc['Vault']

Amanda     9.850
Natalie    9.825
Jamie      9.900
Katie      9.850
Name: Vault, dtype: float64

In [6]:
scores.iloc[1]

Amanda     9.90
Natalie    9.85
Jamie      9.80
Katie      9.90
Name: Bars, dtype: float64

In [7]:
scores.loc['Vault': 'Beam']

       Amanda  Natalie  Jamie  Katie
Vault   9.850    9.825   9.90  9.850
Bars    9.900    9.850   9.80  9.900
Beam    9.775    9.850   9.75  9.875

In [8]:
scores.iloc[0:2]

       Amanda  Natalie  Jamie  Katie
Vault    9.85    9.825    9.9   9.85
Bars     9.90    9.850    9.8   9.90

## Accessing Subsets (at, iat)

### Katie's floor score

In [9]:
scores.at['Floor', 'Katie']

9.85

### Natalie's bars score

In [10]:
scores.iat[1,2]

9.8

## Describe by column

In [11]:
scores.describe()

         Amanda   Natalie   Jamie     Katie
count  4.000000  4.000000  4.0000  4.000000
mean   9.850000  9.856250  9.8375  9.868750
std    0.054006  0.031458  0.0750  0.023936
min    9.775000  9.825000  9.7500  9.850000
25%    9.831250  9.843750  9.7875  9.850000
50%    9.862500  9.850000  9.8500  9.862500
75%    9.881250  9.862500  9.9000  9.881250
max    9.900000  9.900000  9.9000  9.900000

### Controlling the precision

In [12]:
pd.set_option('display.precision', 3)

scores.describe()

       Amanda  Natalie  Jamie  Katie
count   4.000    4.000  4.000  4.000
mean    9.850    9.856  9.838  9.869
std     0.054    0.031  0.075  0.024
min     9.775    9.825  9.750  9.850
25%     9.831    9.844  9.788  9.850
50%     9.863    9.850  9.850  9.863
75%     9.881    9.863  9.900  9.881
max     9.900    9.900  9.900  9.900

## Transpose (rows <--> columns)

In [13]:
scores.mean()

Amanda     9.850
Natalie    9.856
Jamie      9.838
Katie      9.869
dtype: float64

In [14]:
scores.T

         Vault  Bars   Beam  Floor
Amanda   9.850  9.90  9.775  9.875
Natalie  9.825  9.85  9.850  9.900
Jamie    9.900  9.80  9.750  9.900
Katie    9.850  9.90  9.875  9.850

In [15]:
scores.T.describe()

       Vault   Bars   Beam  Floor
count  4.000  4.000  4.000  4.000
mean   9.856  9.863  9.812  9.881
std    0.031  0.048  0.060  0.024
min    9.825  9.800  9.750  9.850
25%    9.844  9.838  9.769  9.869
50%    9.850  9.875  9.812  9.887
75%    9.863  9.900  9.856  9.900
max    9.900  9.900  9.875  9.900

### Sort by rows

In [17]:
scores.sort_index(ascending=False)

       Amanda  Natalie  Jamie  Katie
Vault   9.850    9.825   9.90  9.850
Floor   9.875    9.900   9.90  9.850
Beam    9.775    9.850   9.75  9.875
Bars    9.900    9.850   9.80  9.900

In [18]:
scores.sort_index()

       Amanda  Natalie  Jamie  Katie
Bars    9.900    9.850   9.80  9.900
Beam    9.775    9.850   9.75  9.875
Floor   9.875    9.900   9.90  9.850
Vault   9.850    9.825   9.90  9.850

### Sort by columns

In [19]:
scores.sort_index(axis=1)

       Amanda  Jamie  Katie  Natalie
Vault   9.850   9.90  9.850    9.825
Bars    9.900   9.80  9.900    9.850
Beam    9.775   9.75  9.875    9.850
Floor   9.875   9.90  9.850    9.900

In [20]:
scores.sort_index(axis=1, ascending=False)

       Natalie  Katie  Jamie  Amanda
Vault    9.825  9.850   9.90   9.850
Bars     9.850  9.900   9.80   9.900
Beam     9.850  9.875   9.75   9.775
Floor    9.900  9.850   9.90   9.875